Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: ཆོ་ག་འདི་ནི་མཆོག་ཏུ་དཀོན་པ་ཡིན་ནོ།
en: It is extremely difficult to find.

source: །དཀྱིལ་འཁོར་གྱི་ཆོ་ག་འདི་ཐོས་པ་ཙམ་དང་། རྣ་བའི་བུ་གར་འདིའི་སྒྲ་ལན་བདུན་ངེས་པར་ལྷུང་ན། དེ་འཆི་འཕོ་བ་ཙམ་དང་བསམས་པ་ཙམ་གྱིས་བདེ་བ་ཅན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་སྐྱེ་བར་འགྱུར་ཏེ།
en: Those who merely hear this dhāraṇī-maṇḍala recited seven times into their ear are destined to be reborn in the world sphere of Sukhāvatī immediately after they leave their body.

source: འོད་དཔག་མེད་ཀྱི་སྤྱན་སྔར་ཞབས་ཀྱི་དྲུང་དུ་པདྨ་ལས་རྫུས་ཏེ་སྐྱེ་བར་འགྱུར་རོ། །རྒྱན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་བརྒྱན་པ་དང་།
en: They will be born there, adorned with all ornaments, from a lotus, at the feet and in the immediate presence of Amitābha.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་གསུངས་པའི་མདོ་སྡེ་དང་། ཆོ་ག་ཞིབ་མོ་དང་། དཀྱིལ་འཁོར་དང་།
en: The sūtras, the rites, the maṇḍalas, and the mudrās that were taught by all the tathāgatas will remain at the tip of their tongue.

source: ཕྱག་རྒྱ་རྣམས་ཁ་ཏོན་དུ་ཀུན་དུ་གནས་ཤིང་ཚེ་རབས་དྲན་པར་ཡང་འགྱུར་རོ། །དབང་པོ་དྲུག་ཡོངས་སུ་དག་པ་དང་། མངོན་པར་ཤེས་པ་ལྔ་ཡང་སོ་སོར་ཐོབ་བོ།
en: They will be able to remember their successive rebirths, their six senses will be completely pure, and they will obtain the five superknowledges.

source: །ཙམ་ལ་རབ་ཏུ་སྐྱེ་བར་འགྱུར་རོ། །ལྷའི་གཟུགས་དང་། ཁ་དོག་དང་། རྟགས་དང་།
en: From the moment of their birth, they will have a divine form and complexion and perfect bodily proportions. “

source: དབྱིབས་ཡོངས་སུ་དག་པ་དེའི་ཕྱིར་སྟོབས་དང་བརྩོན་འགྲུས་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་སྣ་ཚོགས་འཛིན་པ་དང་། མཉན་པར་བགྱི། བཀླག་པར་བགྱི། ཁ་ཏོན་དུ་བགྱི།
en: In view of this, all beings, whether they are weak or strong, should embrace this dhāraṇī and request, read, and study it.

source: སེར་སྣའི་དྲི་མ་དང་བྲལ་བ་དང་། ཕྲག་དོག་དང་བྲལ་བར་བགྱི། སེམས་ཅན་ཐམས་ཅད་བྱམས་པ་དང་། སྙིང་རྗེ་ལ་སོགས་པ་མཆོག་དང་ཡང་དག་པར་ལྡན་པས་བགྱིའོ། །གཟུངས་དང་།
en: They should eradicate the stains of jealousy and envy and cultivate compassion, love, pity, and so forth for all beings, making these sentiments their chief preoccupation.

source: དཀྱིལ་འཁོར་གྱི་ཆོ་ག་འདི་མཉན་པར་བགྱི།
en: They should teach, explain, and cause others to practice the procedure of this dhāraṇī-maṇḍala, the value of which is inestimable.

source: བལྟ་བར་བགྱི། འཇུག་པར་བགྱིའོ། །ཕྱི་མའི་དུས་དང་། ཕྱི་མའི་ཚེ་མ་ཡིན་པར་ཕུལ་དུ་བྱུང་བའི་དོན་ལ་བརྩོན་པར་བགྱིའོ་ཞེས་པའོ།
en: It should be practiced with great resolve in the final time of the final period.

source: །འཇིག་རྟེན་ལས་འདས་པའི་སྒྲུབ་ཐབས་ཀྱི་ཆོ་ག་འདི་ནི་བླ་ན་མེད་པ་ཞེས་བགྱིའོ།
en: This supramundane practice procedure is supreme.

source: །མང་དུ་སྨོས་ཅི་འཚལ་ཏེ།
en: What more should I say here?

source: དེ་ལ་འགྲན་སེམས་ཀྱིས་ཀྱང་མཉན་པར་བགྱིའོ་ཞེས་སོ།
en: This procedure should be learned without competitive feelings.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་གཟུངས་འདི་གསུངས་པའི་དེ་མ་ཐག་ཏུ་སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་གྱིས་པོ་ཊ་ལའི་རི་བོ་འདི་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་རང་བཞིན་དུ་གྱུར་ཏོ། །མེ་ཏོག་གི་ཤིང་ལྗོན་པ་དང་། འབྲས་བུའི་ཤིང་ལྗོན་པ་གང་ཡིན་པ་རྣམས་ཀྱང་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་རང་བཞིན་གྱི་ཁང་པ་བརྩེགས་པར་རབ་ཏུ་གྱུར་ཏོ།
en: In the same, brief moment that Noble Avalokiteśvara, the great bodhisattva being, pronounced the dhāraṇī, Potala Mountain turned into the seven types of jewels, as did all the trees there that bear blossoms and fruit.

source: །གང་གཱའི་ཀླུང་གི་བྱེ་མ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་རྣམས་འབུམ་ཕྲག་བྱེ་བ་དགུ་བཅུ་རྩ་དགུའི་རྡུལ་ཕྲ་རབ་དང་མཉམ་པར་རབ་ཏུ་གྱུར་ཏོ། །ལྷ་རྫས་ཀྱི་མེ་ཏོག་དང་འབྲས་བུ་རྣམ་པར་བཀྲ་བ་རྣམ་པ་སྣ་ཚོགས་པ་རྣམས་ཕམ་པར་བྱས་པའི་རྒྱན་རྣམ་པར་བཀྲ་བས་རྣམ་པར་བཀྲ་ཞིང་།
en: A palatial temple appeared, followed by ninety-nine hundred thousand million billion similar temples—as numerous as the grains of sand in the Gaṅgā river—adorned with various colorful flowers and divine fruits.

source: དྲིལ་བུ་གཡེར་ཀའི་དྲ་བ་དང་། གསེར་གྱི་དྲིལ་བུ་འཁྲོལ་བའི་བླ་རེས་དཔྱངས་པ་རྣམས་དང་། ལྷ་རྫས་ཀྱི་སེང་གེའི་ཁྲི་ཡོངས་སུ་བཤམས་པ་རྣམས་ཀྱང་རེ་རེ་ཞིང་ཁང་པ་བརྩེགས་པའི་དབུས་ན།
en: Each temple was decorated with a variety of beautiful nettings and complete with tiny bells, golden bells, silk streamers, canopies, and draperies arranged in cascades above a divine lion seat located in the center of the temple.

source: སེང་གེའི་ཁྲི་བཤམས་པ་བརྒྱ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་དགུར་རབ་ཏུ་བྱུང་བར་གྱུར་ཏེ།
en: As there was such a seat in each temple, ninety-nine hundred thousand lion seats magically appeared.

source: སེང་གེའི་ཁྲི་ཐམས་ཅད་ལ་ཕྱོགས་བཅུ་ནས་དེ་བཞིན་གཤེགས་པ་ཡང་དག་པར་བྱོན་ཏེ་བཞུགས་སོ།
en: On the seats, arrayed everywhere in the ten directions, sat the assembled tathāgatas.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱང་ཕྱག་གསེར་གྱི་ཁ་དོག་ཅན་བརྐྱང་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་སྤྱི་བོའི་གཙུག་ཏུ་ཕྱག་འཇོག་པར་མཛད་ཅིང་།
en: Each of them extended his golden right arm, placed his hand on the head of the noble bodhisattva Avalokiteśvara, and celebrated him, saying, “Good!

source: ལེགས་སོ་ཞེས་བྱ་བའི་སྒྲ་བརྗོད་པར་མཛད་དོ།
en: It is good, Avalokiteśvara!

source: །སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལེགས་སོ་ལེགས་སོ་མཆོག་ཏུ་ཁྱད་པར་དུ་འཕགས་པའི་འཇིག་རྟེན་ལས་འདས་པའི་ལམ་ཆེན་པོར་རབ་ཏུ་བསྟན་པས། སེམས་ཅན་ཐམས་ཅད་ཕ་རོལ་ཏུ་འགྲོ་བར་བྱེད་པ་དང་།
en: The supramundane path that you have shown in order to help all beings cross to the other shore is very special.

source: གང་གིས་ཐོས་པ་ཙམ་གྱིས་འཇིག་རྟེན་ལས་འདས་པ་སོ་སོར་ཁྱད་པར་དུ་འཕགས་པའི་སངས་རྒྱས་ཉིད་ཀྱི་ལམ་ཚོལ་བ་ལ་རྗེས་སུ་འགྲོའོ། །འོན་ཀྱང་བཟླས་པ་དང་། འདྲི་བ་དང་། ཀློག་པ་དང་། དཀྱིལ་འཁོར་མཐོང་བ་དང་།
en: If beings who merely hear it enter the most distinguished supramundane path to buddhahood, what need is there to mention those beings who, in addition to hearing it, undertake to recite it, write it, read it, and see its maṇḍala.

source: འཇུག་པ་ཆེས་མང་པོའི་དབང་དུ་བྱས་པའི་སེམས་ཅན་རྣམས་དམ་ཚིག་ལ་རྗེས་སུ་འཇུག་པར་འགྱུར་བ་དེ། སྐྱེ་བ་འདི་ཉིད་ལ་དེ་བཞིན་གཤེགས་པའི་ལུས་སུ་རིག་པར་བྱའོ།
en: Such beings will follow their samaya and will, in their current birth, awaken to their inner nature as a tathāgata.”

source: །དེ་ནས་པོ་ཊ་ལའི་གནས་ཀྱི་རི་བོ་དང་། རྩྭ་དང་། ཤིང་གེལ་བ་དང་། སྨན་དང་། ནགས་དེ་རྣམས་ཐམས་ཅད་ལ་མི་གང་ཙམ་དུ་མཐོ་བ་ཉིད་དང་།
en: Lotuses then appeared in the abode of Potala Mountain, where all the grasses, bushes, herbs, and trees are human sized.

source: ཤིང་རྟའི་འཁོར་ལོའི་ཚད་ཙམ་པའི་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་རང་བཞིན་ཅན་གྱི་པདྨ་རྣམས་རབ་ཏུ་བྱུང་སྟེ། འདབ་མ་ཁ་དོག་སྣ་ཚོགས་པ་དང་། སྡོང་བུ་བཻ་ཌཱུརྱ་དང་། འཛམ་བུ་ཆུ་བོའི་གསེར་གྱི་ཁ་དོག་ལྟར་དམར་བའི་མུ་ཏིག་གི་ཟེའུ་འབྲུ་དང་། ལྷ་རྫས་ཀྱི་མུ་ཏིག་གི་གེ་སར་གྱིས་ཁོར་ཡུག་ཏུ་བསྐོར་བ་གང་ཡིན་པ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་བཞུགས་ཏེ།
en: Each lotus was the size of a cartwheel, was made of seven precious jewels, and had petals in various colors, beryl stalks the color of gold from the river Jambu, round pericarps made of red pearl, and stamens made of celestial pearls.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་རྣམས་ཐམས་ཅད་ཀྱང་ཆོས་ལ་གུས་པས་ཐམས་ཅད་པུས་མོ་བཙུགས་ཏེ། གཟུངས་འདིའི་དཀྱིལ་འཁོར་དང་ཕྱག་རྒྱ་མཐོང་བའི་དོན་དུ་མུ་ཏིག་གི་དོ་ཤལ་བརྒྱ་སྟོང་རིབ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་མངོན་པར་བཀབ་པར་གྱུར་ཏོ།
en: On the lotuses sat great bodhisattva beings, all of whom knelt down before Noble Avalokiteśvara, the great bodhisattva being, and out of respect for the Dharma bedecked him with pearl necklaces worth hundreds of thousands, in return for his teaching and demonstrating the seal of this dhāraṇī-mandala.

source: །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་རྡོ་རྗེའི་རང་བཞིན་དུ་བྱིན་གྱིས་བརླབས་པ་འདི་ཡང་ཆེས་ཆེར་གཡོས་པར་གྱུར་ཏོ།
en: A great earthquake rattled the great trichiliocosm whose world systems, blessed by the dhāraṇī, turned into diamond.

source: །ལྷའི་མེ་ཏོག་གི་ཆར་ཆེན་པོ་མང་པོ་རབ་ཏུ་ཕབ་སྟེ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མཆོད་པའི་དོན་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་མཆོད་པའི་དོན་དང་། གཟུངས་འདིའི་དཀྱིལ་འཁོར་དམ་པ་ལ་མཆོད་པའི་དོན་དུ་ཆར་རབ་ཏུ་ཕབ་བོ།
en: A great rain of divine flowers fell to convey offerings to all the tathāgatas and bodhisattvas and to make supreme, extensive offerings to the dhāraṇī-maṇḍala.

source: །དེ་ནས་ཡང་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ལག་ན་རྡོ་རྗེས་བཞིན་འཛུམ་ཞིང་རྡོ་རྗེ་བསྐོར་བཞིན་དུ་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་དོང་སྟེ་ལྷགས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འཇིག་རྟེན་ལས་འདས་པའི་གཟུངས་ཀྱི་དཀྱིལ་འཁོར་གྱི་ཆོ་ག་འདི་ནི་ཤིན་ཏུ་རྙེད་པར་དཀའ་བ་སྟེ། འདི་ལྟ་བུའི་རྫུ་འཕྲུལ་གྱི་རྣམ་པར་འཕྲུལ་པ་དང་།
en: Vajrapāṇi, the great yakṣa general, smiling and waving his vajra, approached the Blessed One, saluted him by touching his feet with his head, and said, “It is very difficult, O Blessed One, to obtain the supramundane procedure of this dhāraṇī-maṇḍala, one that can produce a display of magical powers and miracles such as we are seeing.

source: ཆོ་འཕྲུལ་ནི་དེ་བཞིན་གཤེགས་པ་བསྐྱེད་པ་བལྟ་བར་བགྱི། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་བལྟ་བར་བགྱི། དེ་བཞིན་གཤེགས་པ་དང་མཉམ་པ་ཉིད་དུ་བལྟ་བར་བགྱིའོ།
en: One can observe the arising of a tathāgata and the turning of the wheel of Dharma—this dhāraṇī should be regarded to be the same as a tathāgata.

source: །བཅོམ་ལྡན་འདས་མཐུ་ཆེན་པོ་འདི་འཛམ་བུའི་གླིང་ན་མཆོག་ཏུ་དཀོན་པར་བལྟ་བར་བགྱི་སྟེ།
en: Such a supremely great power, one that is difficult to find, can be found in Jambudvīpa, O Blessed One.

source: འདི་ནི་ཕྱི་མའི་དུས་ཕྱི་མའི་ཚེ་ན། དེ་བཞིན་གཤེགས་པའི་མཛད་པ་དང་། སངས་རྒྱས་ཀྱི་མཛད་པ་བྱེད་པར་འགྱུར་རོ།
en: This power will accomplish the work of the tathāgatas and the work of the Buddha in the final time of the final period.

source: །གང་གིས་ཐོས་པ་ཙམ་གྱིས་འདི་ལྟ་བུའི་ཡོན་ཏན་དང་ཕན་ཡོན་སོ་སོར་ཐོབ་བོ།
en: By merely recollecting this dhāraṇī, one will obtain the benefit of the qualities that are described.

source: །ཀུན་ཏུ་སྣང་བར་བྱེད་པར་འགྱུར་བ་འདི་ཉིད་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་མ་གཏོགས་པར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ནང་ན་གཞན་སུ་ཡང་མ་མཆིས་སོ།
en: This dhāraṇī alone will become a beacon of light for the world. There is no savior of any being other than the Lokeśvara, the great bodhisattva being, who is present here.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ལག་ན་རྡོ་རྗེ་ཇི་སྐད་སྨྲས་པ་དེ་དེ་བཞིན་ནོ།
en: The Blessed One replied, “It is just as you said, Vajrapāṇi!

source: །ལག་ན་རྡོ་རྗེ་འཛམ་བུའི་གླིང་པའི་སེམས་ཅན་ཐམས་ཅད་མདང་ཕར་གྱུར་པ་འདི་གཟུངས་ཀྱི་དཀྱིལ་འཁོར་འདི་དང་།
en: All the beings in Jambudvīpa who are born to mothers and fathers, O Vajrapāṇi, constitute this dhāraṇī-maṇḍala.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་འདི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་རེ་བ་སྐོང་བ་དང་། སྐྱོབ་པ་དང་། སྐྱབས་དང་། འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པའི་དཔུང་གཉེན་བྱེད་པ་ནས། ཇི་སྲིད་བུད་མེད་དང་། སྐྱེས་པ་དང་། ཁྱེའུ་དང་། བུ་མོ་སེམས་ཅན་ཐམས་ཅད་སངས་རྒྱས་ཉིད་ཀྱི་བདག་ཉིད་ཀྱི་བར་ལ་རབ་ཏུ་འགོད་པར་བྱེད་དོ།
en: And here is Noble Avalokiteśvara, the great bodhisattva being who is wholly dedicated to protecting, fulfilling the hopes of, and providing refuge to all beings, both on the worldly and supramundane levels, until all these beings—each and every woman, man, boy, and girl—are established in buddhahood.

source: །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་སྟོབས་དང་། བརྩོན་འགྲུས་དང་། ཕ་རོལ་གནོན་པས་སྔོན་སེམས་ཅན་རྣམས་ལ་ཕན་པའི་དོན་དུ་ཞུགས་པ་ཡིན་ནོ།
en: The noble bodhisattva Avalokiteśvara, who possesses strength, energy, and courage, arose in former times to bring benefit to beings.”

source: །དེ་ནས་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ལག་ན་རྡོ་རྗེ། ཉི་མའི་འོད་ཟེར་གྱི་སྙིང་པོ་དྲི་མ་མེད་པ་ཞེས་བྱ་བའི་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་ཐོགས་ནས། བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གང་ན་བ་དེར་དོང་སྟེ་ལྷགས་ནས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས། ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དེ་ཡང་མངོན་པར་དགབ་པར་ཕུལ་ལོ།
en: Vajrapāṇi, the great yakṣa general, then took a great gem called bright as the sun and innately pure, walked up to Noble Avalokiteśvara, the great bodhisattva being, bowed down, touched his head to the feet of Noble Avalokiteśvara, the great bodhisattva being, and offered him the gem as a gift.

source: །ལྷ་རྫས་ཀྱི་མེ་ཏོག་སྣ་ཚོགས་པས་གཅལ་དུ་བཀྲམ་པ། མཆོད་པའི་དོན་དུ་རབ་ཏུ་བཀོད་ནས་རང་གི་སྟན་ལ་འདུག་གོ།
en: He then went to his seat, which had been bestrewn with various divine flowers as an act of worship, and sat down.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་དོན་ཡོད་པ་དྲི་མ་མེད་ཅིང་རྣམ་པར་དག་པ་རབ་ཏུ་གསལ་བའི་འོད་ཟེར་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་སོ།
en: At that time, the blessed Tathāgata Śākyamuni, the worthy one, the fully realized Buddha, entered the samādhi called immaculately pure amogha radiance.

source: །བཅོམ་ལྡན་འདས་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་པ་གང་གིས་སྤྱི་བོའི་གཙུག་ཏུ་གདུགས་ཀྱི་རྣམ་པའི་ཁང་པ་བརྩེགས་པ་ཀུན་ཏུ་གནས་པར་གྱུར་ཏོ།
en: While the Blessed One was in samādhi, a palatial temple shaped like a parasol appeared at his fontanelle.

source: །ཁང་པ་བརྩེགས་པ་དེ་ལས་ཀྱང་འོད་ཟེར་རྣམ་པ་སྣ་ཚོགས་པ་བྱུང་ངོ་། །འོད་ཟེར་སྣ་ཚོགས་པའི་སྣང་བ་དེས་ཀྱང་ནམ་མཁའི་མཐིལ་དུ་རྫུ་འཕྲུལ་གྱི་རྣམ་པར་འཕྲུལ་པ་དང་། ཆོ་འཕྲུལ་ཆེན་པོ་སྣ་ཚོགས་པ་བསྟན་ཏོ།
en: Light of various colors radiated from this temple, and amid this effulgence of multicolored light a wonderful sight of various magical, miraculous displays appeared in the canopy of the sky.

source: །འོད་ཟེར་གྱི་སྣང་བ་རེ་རེས་ཀྱང་དེ་བཞིན་གཤེགས་པའི་སྐུ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་དགུ་རབ་ཏུ་བསྟན་ནོ།
en: The body of the Tathāgata could be seen in each individual ray of light, altogether equaling hundreds of millions of billions of bodies as numerous as grains of sand in ninety-nine Gaṅgā rivers.

source: །དེ་བཞིན་གཤེགས་པའི་སྐུ་དེ་རྣམས་ཐམས་ཅད་ཀྱིས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ། སེམས་ཅན་ཆེན་པོ་མཆོག་ཏུ་རྙེད་པར་དཀའ་བའི་གཟུངས་ཀྱི་དཀྱིལ་འཁོར་དང་།
en: All these bodies of the Tathāgata applauded Noble Avalokiteśvara, the great bodhisattva being, saying, “Good!

source: ཕྱག་རྒྱ་འདི་བཤད་པ་འདི་ལེགས་སོ་ལེགས་སོ། །འཇིག་རྟེན་ལས་འདས་པ་ཤིན་ཏུ་ཁྱད་པར་དུ་འཕགས་པའི་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་འགྲོ་བར་བྱེད་པའི་ལམ། ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་བར་བྱེད་པའི་ལམ། ཆོས་ཀྱི་རྣམ་འཕྲུལ་འབར་བར་བྱེད་པ།
en: It is good, O great being!

source: ཆོས་ཀྱི་རྒྱལ་མཚན་སྒྲེང་བར་བྱེད་པ། ཆོས་ཀྱི་དུང་འབུད་པར་བྱེད་པ། བདུད་བཞིའི་དཀྱིལ་འཁོར་ལས་རྣམ་པར་རྒྱལ་བར་བྱེད་པ། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུས་གནོན་པར་བྱེད་པ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་རབ་ཏུ་རྫོགས་པར་བྱེད་པ། མི་འཇིགས་པ་བཞིས་གནོན་པར་བྱེད་པ་དེ་བཞིན་ཉིད་དང་།
en: You have spoken this seal of the dhāraṇī-maṇḍala that is extremely difficult to find, the seal that constitutes the special supramundane path leading to the seat of awakening, to the turning of the wheel of Dharma, to blazing magical Dharma displays, to the raising of the banner of Dharma, to the blowing of the conch of Dharma, to victory over the cycle of the four māras, to the obtainment of the ten strengths of a tathāgata, to the obtainment of the eighteen special qualities of a buddha, to the development of the four types of confidence, to the attainment of the ultimate reality of thatness, and to the mastery of the ten perfections.

source: ཡང་དག་པའི་མཐའ་ཕ་རོལ་གནོན་པར་བྱེད་པ། ཕ་རོལ་ཏུ་ཕྱིན་པ་བཅུ་རབ་ཏུ་རྫོགས་པར་བྱེད་པའོ། །འདི་ནི་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་སྒོམ་པར་བྱེད་པའོ།
en: This dhāraṇī promotes the eightfold path of the noble ones.

source: །འདི་ནི་ལམ་རབ་ཏུ་ཉམས་པ་རྣམས་ཀྱི་ལམ་དུ་འཆགས་པར་བྱེད་པ།
en: It brings those who have strayed from the path back onto it and gives them purpose.

source: བསམ་པ་རབ་ཏུ་ཉམས་པ་རྣམས་ཀྱི་བསམ་པ་ཡོངས་སུ་དག་པ།
en: It purifies the hearts of those who whose hearts are corrupt.

source: ངན་སོང་དུ་འགྲོ་བར་རྒྱུ་བ་རྣམས་ཀྱི་བདེ་འགྲོའི་ལམ་དུ་འགྲོ་བར་བྱེད་པ།
en: It leads those who are destined for unhappy rebirths to happy rebirths instead.

source: འདི་ནི་བྱང་ཆུབ་ཆེན་པོའི་ས་བོན་དང་། འབྲས་བུ་རབ་ཏུ་སྟོན་པར་བྱེད་པའོ།
en: It reveals the seed and the fruition of the great seat of awakening.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །སེམས་ཅན་དག་པ་འཇིག་རྟེན་ལས་འདས་པ་ཁྱད་པར་དུ་འཕགས་པ་རྣམ་པར་ཐར་བའི་དཀྱིལ་འཁོར་དོན་ཡོད་པའི་ཞགས་པའི་རྣམ་པར་འཕྲུལ་པ་འཇིག་རྟེན་ལས་འདས་པའི་དཀྱིལ་འཁོར་གྱི་ཉེ་བར་སྤྱོད་པའི་ཆོ་ག་ཤོད་ཅིག །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔ་ནས་བསྐུལ་བ་ཐོབ་ནས། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར། འཇིག་རྟེན་ལས་འདས་པའི་ཆོ་ག་དང་། དཀྱིལ་འཁོར་གྱི་ཉེ་བར་སྤྱོད་པའི་ཆོ་ག་དང་།
en: The blessed Tathāgata Śākyamuni said to Noble Avalokiteśvara, the great bodhisattva being, “Please teach, O pure being, this expressly supramundane maṇḍala of liberation, the practice procedure of the supramundane maṇḍala that is a magical amogha transformation.”

source: སྒྲུབ་ཐབས་གསུངས་སོ། །གནས་བཟང་ས་གཞི་དགེ་བ་དང་། །ས་གཞི་གཙང་ཞིང་ནེའུ་གསིང་ལ། །ལྗོན་ཤིང་མེ་ཏོག་འབྲས་བུས་ཁྱབ། །མེ་ཏོག་འཁྲི་ཤིང་འགྲམ་དང་ནི།
en: Hearing the Blessed One’s request to teach, Noble Avalokiteśvara, the great bodhisattva being, faced the Blessed One and taught the supramundane procedure of the formal practice of the maṇḍala: “The vidyā holder should find a nice place in a suitable location where the ground is clean, verdant with grass, and abounding in flowers, fruits, and trees covered in blossom and vines.

source: །ས་གཞི་མཉེན་ལ་དག་པ་དང་། །གང་དུ་ཆུ་བོ་འབབ་པ་དང་།
en: The place should have a smooth, clean surface and be close to a flowing stream.

source: །གཟི་བརྗིད་ལྡན་ཞིང་ཡིད་དགའ་བ། །ས་གཞི་སེམས་ནི་དགའ་བར་འོས། །ཡིད་ཀྱི་ཤིང་རྟ་རྒྱས་བྱེད་ཅིང་། །གོ་སྐབས་ལེགས་པར་གནས་པ་དང་།
en: It should be bright and pleasant, pleasing to the mind, and with much open space.

source: །ཤིན་ཏུ་དག་ཅིང་ཐུན་ཚགས་བྲལ། །རུས་པ་གསེག་མ་གྱོ་མོ་དང་། །ཕུབ་མ་སོལ་བ་ཡོངས་སུ་སྤངས།
en: It should be pure and free from anything defiling, such as skeletal remains, gravel, feces, and vomit.

source: །གཙང་ཞིང་གཙང་ལ་ལེགས་དག་པའི། །ས་གཞི་ཡོངས་སུ་ཟླུམ་པ་དེར།
en: The ground should be completely clean and entirely pure.

source: །མཁས་པས་རྒྱར་ནི་གཟིངས་ཚད་དུ། །གཞལ་ནས་ཤིན་ཏུ་རྣམ་འབྱེས་ཤིང་། །གཙང་ཞིང་མཉེན་ལ་འཇམ་པར་ཕྱེ། །གནས་དེར་དཀྱིལ་འཁོར་ལེགས་པར་བསྒྲུབས།
en: There he should skillfully delimit a symmetrical enclosure that is the width of a boat and is clean, soft, and smooth.

source: །སངས་རྒྱས་བྱང་ཆུབ་བླ་ན་མེད།
en: If he sets up the maṇḍala and sits there, he will attain the supreme awakening of the Buddha.

source: །འཇིག་རྟེན་ལས་འདས་ཁྱད་འཕགས་པར། །དེ་བཞིན་གཤེགས་ཀུན་གྱིས་བྱིན་བརླབས།
en: Such a unique place is supramundane and blessed by all the tathāgatas. “

source: །ས་ཡི་ཆ་ལས་དཔངས་སུ་ནི། །མི་གང་ཚད་དུ་བརྐོ་བར་བྱ། །གཟུངས་དང་དཀྱིལ་འཁོར་དམར་པོའམ། །ཡང་ན་གུར་གུམ་ཁ་དོག་དང་།
en: The vidyā holder should excavate an area on the ground to the depth of a human head and color it red or saffron.

source: །ས་རྡུལ་དཀར་པོ་སྣུམ་པ་ནི། །མར་སར་འདྲ་བ་འཇམ་པ་ཡིན།
en: It should be smoothed over with white powder and soft like freshly churned butter.

source: །ས་ཡི་ཁྱད་པར་དབྱེ་བ་དེ། །དེ་བཞིན་གཤེགས་པ་ཀུན་གྱིས་བསྔགས། །བྱང་ཆུབ་སྙིང་པོ་ས་དེར་མཚུངས། །རིང་བསྲེལ་བཞུགས་པའི་མཆོད་རྟེན་དང་། །དེ་ནི་མཚུངས་པར་གྱུར་པ་ཡིན།
en: Such special ground is praised by all the tathāgatas—it is the ground of awakening, and it is equal to a reliquary or a caitya.

source: །བརྐོས་པའི་ནང་དུ་མཁས་པ་ཡིས། །སླར་ཡང་ས་དེ་དགང་བར་བྱ།
en: The learned vidyā holder should fill it with dust from the earth.

source: །ཇི་སྲིད་དོང་བུ་མཉམ་པར་གང་། །དེ་ནི་དཀྱིལ་འཁོར་ཡང་དག་པའོ།
en: When the cavity is filled to the level of the ground, it serves as a true maṇḍala.

source: །ཉུང་དང་ལྷག་པ་བསྔགས་པ་མིན། །འདིར་ནི་འགྲུབ་པ་མེད་པར་བསྟན།
en: If it is not filled enough or is filled too much, it is not perfect and will not bring accomplishment. “

source: །ཁྲུ་ནི་སུམ་ཅུ་རྩ་གཉིས་ཚད། །མཁས་པས་དཀྱིལ་འཁོར་ཐིག་དག་གདབ། །ཡང་ན་ཁྲུ་ནི་བཅུ་དྲུག་དང་། །ཡང་ན་ཁྲུ་ནི་བཅོ་ལྔར་བྱ། །མཉམ་ཞིང་གྲྭ་བཞིར་ལེགས་པར་དབྱེ།
en: Using thread, the wise vidyā holder should carefully delimit a square maṇḍala either thirty-two, sixteen, or five cubits in diameter.

source: །བ་ཡི་ལྕི་བ་དག་དང་ནི། །ས་དང་བསྲེས་ཏེ་བསྐུ་བྱ་བ། །ཤིན་ཏུ་ཞེན་པར་བསྡིག་པ་དང་། །འཇམ་ཞིང་མཉེན་པར་བྱ་བ་ཡིན།
en: It should be smeared with a mixture of clay and cow dung, have a smooth finish, and be pliable and soft.

source: །དེ་ལ་དཀྱིལ་འཁོར་ཐིག་གདབ་པ། །སྣ་ཚོགས་ཚོན་གྱིས་ཀུན་ཏུ་དབྱེ།
en: It should be surrounded on the outside by thread, and its various parts should have different colors.

source: །སྒོ་བཞི་རྣམ་པར་འབྱེས་པ་དང་། །རྟ་བབས་བཞི་དང་ལྡན་པར་བྱ། །དཀྱིལ་འཁོར་དབུས་ཀྱི་སྙིང་པོ་ནི།
en: The four doors should be adorned with arched gateways.

source: །རྣམ་པར་ཕྱེ་སྟེ་གྲུ་བཞི་ཚད། །ཁྲུ་གསུམ་ཡང་ན་ཁྲུ་བཞི་ནི། །ཐིག་སྐུད་ཚོན་གྱིས་རྣམ་པར་དབྱེ། །ནང་གི་ཐིག་ནི་ཚད་དག་ཏུ། །མདུང་རྩེ་གསུམ་པ་དག་དང་ནི།
en: Inside the maṇḍala, the vidyā holder should use colored thread to delimit a square area that is either three or four cubits across.

source: །ནོར་བུ་རིན་ཆེན་སྣ་ཚོགས་བྱ། །བར་གྱི་ཐིག་གི་ཚད་དག་ཏུ། །པདྨ་དང་ནི་རྡོ་རྗེ་དག །ཀུན་ཏུ་བྲི་བར་བྱ་བ་ཡིན། །ཕྱི་ཡི་ཐིག་གི་ཚད་དག་ཏུ། །རྡོ་རྗེ་རྣམ་པའི་སྟེགས་བུ་དང་། །རིན་ཆེན་སྣ་ཚོགས་གཞལ་མེད་ཁང་། །སྟེགས་བུ་དག་ཀྱང་བྲི་བར་བྱ།
en: He should draw an inner line of tridents brightly adorned with jewels and gems, an intermediate line of vajras and lotuses, and, along the outer line, a railing of vajra shapes made from various jewels. “

source: །པདྨའི་དབུས་སུ་གཞལ་མེད་ཁང་། །གཞལ་ཡས་ཁང་པ་གནས་པར་བྱ།
en: In the center he should place a temple-palace with lotuses inside it.

source: །དཀྱིལ་འཁོར་དབུས་ཀྱི་པདྨ་ལ། །རྣམ་པར་སྣང་མཛད་ཐུབ་པ་བྱ། །གཡོན་དུ་འོང་ནི་དཔག་མེད་པ། །གཡས་ཕྱོགས་སུ་ནི་དེ་བཞིན་གཤེགས། །ཤཱཀྱའི་རྒྱལ་པོ་དག་དང་ནི། །དོན་ཡོད་རྒྱལ་པོ་འཇིག་རྟེན་གྱི།
en: In its center he should place the sage Vairocana on a lotus, Amitābha to the left, and the Tathāgata, the king of the Śākyas, to the right.

source: །དབང་ཕྱུག་མགོན་ལ་མངོན་སུམ་དུ། །བཏུད་དེ་ཐལ་མོ་སྦྱོར་བ་ནི།
en: Opposite Lord Śākyamuni should be the lokeśvara Amogharāja, standing up and bowing with folded hands.

source: །ཕྱག་བཞི་པར་ནི་བྱ་བ་ཡིན། །ཕྱག་གཉིས་ཀྱིས་ནི་སྣ་ཚོགས་པའི། །མེ་ཏོག་རྣམས་ནི་འཆང་བ་དང་། །རྒྱན་རྣམས་ཀུན་གྱིས་བརྒྱན་པར་བྱ།
en: He should be drawn with four arms, two of which hold various flowers, and be adorned with all ornaments.

source: །འོད་དཔག་མེད་པའི་མདུན་དུ་ནི། །ཁྲོ་བོའི་རྒྱལ་པོ་ཕྱག་བཞི་བ། །བཏུད་དེ་ཐལ་མོ་སྦྱོར་བ་དང་། །ལྷ་རྫས་མེ་ཏོག་སྣ་ཚོགས་པ། །ལག་པ་གཉིས་ན་ཐོགས་པ་དང་།
en: Krodharāja should be drawn opposite Amitābha; he should have four arms and be standing up and bowing with two of his hands folded, while the other pair hold various divine flowers.

source: །སྣ་ཚོགས་རྒྱན་གྱིས་བརྒྱན་པར་བྱ།
en: He is adorned with various ornaments.

source: །དབུས་ཀྱི་དཀྱིལ་འཁོར་ལེགས་བརྒྱན་པ། །སྣ་ཚོགས་དར་གྱིས་མཛེས་པར་བྱ། །དོན་ཡོད་ཞགས་པའི་ཕྱག་རྒྱ་ཆེ། །པདྨ་གདན་དང་རྣམ་རྒྱན་པ།
en: The area in the center should be decorated with silk streamers and divine ornaments and adorned with a lotus seat.

source: །འབར་བའི་ནང་ན་ཡོད་པར་བྱ།
en: Upon the seat should be the great mudrā of Amoghapāśa surrounded by blazing light. “

source: །གྲྭ་བཞིར་དག་ནི་བྱས་ན་ནི། །གཉིས་ཀྱི་བར་གྱི་ཆ་བཞི་སྟེ། །དབུས་ཀྱི་གནས་སུ་འཇིགས་མེད་པ། །ཤར་གྱི་གནས་སུ་གནས་པ་ནི། །ལྷ་མོ་སྒྲོལ་མ་རྣམ་པར་བརྒྱན། །གཡས་ཀྱི་གནས་སུ་གནས་པ་ནི།
en: He should draw the four goddesses, skillfully placed halfway between the corners and aligned with the four quarters.

source: །གོས་དཀར་མོ་ནི་རྣམ་པར་བརྒྱན། །ནུབ་ཀྱི་གནས་ན་གནས་པ་ནི། །ལྷ་མོ་དཀར་མོ་རྣམ་པར་བརྒྱན། །བྱང་གི་གནས་ན་གནས་པ་ནི། །ལྷ་མོ་པདྨ་མཛེས་དགའ་བརྒྱན།
en: He should draw the goddess Tārā seated in the eastern quarter and adorned with ornaments; Pāṇḍaravāsinī is seated in the southern quarter and adorned with ornaments, the goddess Śvetā is seated in the western quarter and adorned with ornaments, and the goddess Padmasundarī is seated in the northern quarter and adorned with ornaments.

source: །དཀྱིལ་འཁོར་ཕྱི་རིམ་གྲྭ་རྣམས་སུ། །རྒྱལ་ཆེན་བཞི་ནི་གཞག་པར་བྱ། །བར་གྱི་གནས་སུ་གཞག་པ་ནི།
en: The corners of the outer circle should house the Four Great Kings.

source: །རལ་པ་གཅིག་པ་གཏུམ་མོ་ཤར། །ནུབ་ཏུ་ཕོ་ཉ་བཞིན་སྒྱུར་མ། །གཡས་ཕྱོགས་སུ་ནི་བཞིན་སྒྱུར་མ། །རྡོ་རྗེ་ལྕགས་སྒྲོག་བྱ་བ་ཡིན། །བྱང་དུ་སྲིན་མོ་ཁྲོ་གཉེར་གདོང་།
en: On the inside, the wild Ekajaṭā should be in the east, Dūtī with a contorted face is in the west, Vajraśaṅkalī with protruding fangs is in the south, and Rākṣasī with knitted brows is in the north.
